Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: This guide covers the usage of MongoDB using active records and repositories.
pt_br: Este guia aborda o uso do MongoDB usando <i>active records</i> e repositórios.

source: This guide covers:
pt_br: Este guia inclui:

source: This guide covers: * Gradle configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
pt_br: Este guia abrange: * Configuração Gradle * Criação de um novo projeto * Lidar com extensões * Modo de desenvolvimento *Depuração * Importar em seu IDE * Construção de um executável nativo * Construa um executável amigável para contêineres

source: This guide covers: * Maven configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
pt_br: Este guia abrange: * Configuração do Maven * Criação de um novo projeto * Lidar com extensões * Modo de desenvolvimento *Depuração * Importar em seu IDE * Construção de um executável nativo * Construa um executável amigável para contêineres

source: This guide covers: * Testing in JVM mode * Testing in native mode * Injection of resources into tests
pt_br: Este guia aborda: * Testes no modo JVM * Testes no modo nativo * Injeção de recursos nos testes

source: This guide demonstrates how to add a RESTEasy Reactive filter to help prevent CSRF attacks.
pt_br: Este guia demonstra como adicionar um filtro RESTEasy Reactive para ajudar a evitar ataques CSRF.

source: This guide demonstrates how to get started with Quarkus security using Basic authentication and a database to store your user identities with Hibernate ORM.
pt_br: Este guia demonstra como começar a usar a segurança do Quarkus usando a autenticação básica e um banco de dados para armazenar suas identidades de usuário com o Hibernate ORM.

source: This guide demonstrates how to use reactive routes.
pt_br: Este guia demonstra como usar rotas reativas.

source: This guide demonstrates how to use the Fabric8 Kubernetes client to interact with your Kubernetes cluster.
pt_br: Este guia demonstra como usar o Fabric8 Kubernetes Client para interagir com seu cluster Kubernetes.

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS service application using Bearer Token Authorization where the tokens are issued by OpenID Connect Providers such as Keycloak.
pt_br: Este guia demonstra como utilizar a extensão OpenID Connect para proteger a sua aplicação de serviço Quarkus JAX-RS utilizando a Autorização de Token de Portador em que os tokens são emitidos por Fornecedores OpenID Connect como o Keycloak.

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS web application using the Authorization Code Flow and OpenID Connect Providers such as Keycloak.
pt_br: Este guia demonstra como usar a extensão OpenID Connect para proteger sua aplicação Web Quarkus JAX-RS usando o Authorization Code Flow e OpenID Connect Providers, como Keycloak.

source: This guide demonstrates how your OpenID Connect application can support multi-tenancy so that you can serve multiple tenants from a single application.
pt_br: Este guia demonstra como seu aplicativo OpenID Connect pode oferecer suporte a multilocação para que você possa atender vários locatários de um único aplicativo.

source: This guide demonstrates how your Quarkus application can authorize access to protected resources using Keycloak Authorization Services.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode autorizar o acesso a recursos protegidos utilizando os Serviços de Autorização Keycloak.

source: This guide demonstrates how your Quarkus application can collect metrics using the Micrometer extension.
pt_br: Este guia demonstra como sua aplicação Quarkus pode coletar métricas usando a extensão Micrometer.

source: This guide demonstrates how your Quarkus application can connect to a Redis server using the Redis Client extension.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode se conectar a um servidor Redis utilizando a extensão Redis Client.

source: This guide demonstrates how your Quarkus application can use JMS messaging with AMQP 1.0 using Apache Qpid JMS, or using Apache ActiveMQ Artemis JMS.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar mensagens JMS com AMQP 1.0 utilizando o Apache Qpid JMS, ou utilizando o Apache ActiveMQ Artemis JMS.

source: This guide demonstrates how your Quarkus application can use Kogito to add business automation to power it up with business processes and rules.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar o Kogito para adicionar automação comercial para aprimorá-lo com processos e regras de negócios.

source: This guide demonstrates how your Quarkus application can use WebAuthn authentication instead of passwords.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar a autenticação WebAuthn em vez de senhas.

source: This guide demonstrates how your Quarkus application can use a .properties file to store your user identities.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar um arquivo .properties para armazenar suas identidades de usuário.

source: This guide demonstrates how your Quarkus application can use a LDAP directory to store your user identities.
pt_br: Este guia demonstra como sua aplicação Quarkus pode usar um diretório LDAP para armazenar suas identidades de usuário.

source: This guide demonstrates how your Quarkus application can use a database to store your user identities.
pt_br: Este guia demonstra como seu aplicativo Quarkus pode usar um banco de dados para armazenar suas identidades de usuário.

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce HTTP messages.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para consumir e produzir mensagens HTTP.

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce messages via WebSockets.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para consumir e produzir mensagens via WebSockets.

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para interagir com o AMQP.

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Kafka.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para interagir com o Apache Kafka.

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with RabbitMQ.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar o SmallRye Reactive Messaging para interagir com o RabbitMQ.

source: This guide demonstrates how your Quarkus application can utilize the Apache Kafka Streams API to implement stream processing applications based on Apache Kafka.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar a API Apache Kafka Streams para implementar aplicações de processamento de fluxo baseadas no Apache Kafka.

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance extension.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar a extensão SmallRye Fault Tolerance.

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance specification through the SmallRye Fault Tolerance extension.
pt_br: Este guia demonstra como a sua aplicação Quarkus pode utilizar a especificação SmallRye Fault Tolerance através da extensão SmallRye Fault Tolerance.

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Health extension.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar a extensão SmallRye Health.

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Metrics extension.
pt_br: Este guia demonstra como sua aplicação Quarkus pode utilizar a extensão SmallRye Metrics.

source: This guide explains Funqy's Amazon Lambda HTTP binding.
pt_br: Este guia explica a associação HTTP do Amazon Lambda do Funqy.

source: This guide explains Funqy's Amazon Lambda binding.
pt_br: Este guia explica a associação do Amazon Lambda do Funqy.

source: This guide explains Funqy's Azure Functions HTTP binding.
pt_br: Este guia explica a associação HTTP do Azure Functions do Funqy.

source: This guide explains Funqy's Google Cloud Platform Functions HTTP binding.
pt_br: Este guia explica a vinculação HTTP do Google Cloud Platform Functions da Funqy.

source: This guide explains Funqy's Google Cloud Platform Functions binding.
pt_br: Este guia explica a vinculação do Google Cloud Platform Functions da Funqy.

source: This guide explains Funqy's HTTP binding.
pt_br: Este guia explica a associação HTTP do Funqy.

source: This guide explains Funqy's Knative Events binding.
pt_br: Este guia explica a associação Knative Events do Funqy.

source: This guide explains basics of the Funqy framework, a simple portable cross-provider cloud function API.
pt_br: Este guia explica os conceitos básicos da estrutura Funqy, uma API de função de nuvem portátil simples entre provedores.

source: This guide explains how different beans can interact using the event bus.
pt_br: Este guia explica como diferentes beans podem interagir usando o barramento de eventos.

source: This guide explains how to best measure the footprint of a Quarkus application.
pt_br: Este guia explica como medir melhor o rastro de uma aplicação Quarkus.

source: This guide explains how to cache expensive method calls of your CDI beans using simple annotations.
pt_br: Este guia explica como armazenar em cache chamadas de método custosas de seus beans CDI usando anotações simples.

source: This guide explains how to centralize your logs with Logstash or Fluentd using the Graylog Extended Log Format (GELF).
pt_br: Este guia explica como centralizar seus logs com Logstash ou Fluentd usando o Graylog Extended Log Format (GELF).

source: This guide explains how to configure Quarkus to authenticate against well-known OpenID Connect providers such as GitHub, Google, Microsoft, Apple...
pt_br: Este guia explica como configurar o Quarkus para se autenticar em provedores OpenID Connect bem conhecidos, como GitHub, Google, Microsoft, Apple...

source: This guide explains how to consume gRPC services in your Quarkus application.
pt_br: Este guia explica como consumir serviços gRPC na sua aplicação Quarkus.

source: This guide explains how to deploy a Quarkus application to Google Cloud.
pt_br: Este guia explica como implantar um aplicativo Quarkus no Google Cloud.

source: This guide explains how to deploy a Quarkus application to Microsoft Azure Cloud.
pt_br: Este guia explica como implantar um aplicativo Quarkus na Nuvem do Microsoft Azure.

source: This guide explains how to implement gRPC services in your Quarkus application.
pt_br: Este guia explica como implementar serviços gRPC na sua aplicação Quarkus.

source: This guide explains how to leverage SmallRye GraphQL Client to consume GraphQL services.
pt_br: Este guia explica como aproveitar o Cliente SmallRye GraphQL para consumir serviços GraphQL.

source: This guide explains how to leverage SmallRye GraphQL to implement GraphQL services.
pt_br: Este guia explica como aproveitar o SmallRye GraphQL para implementar serviços GraphQL.

source: This guide explains how to measure the test coverage of your Quarkus application.
pt_br: Este guia explica como medir a cobertura de teste da sua aplicação Quarkus.

source: This guide explains how to migrate an application from RESTEasy Classic to RESTEasy Reactive.
pt_br: Este guia explica como migrar um aplicativo do RESTEasy Classic para o RESTEasy Reactive.

source: This guide explains how to start using gRPC in your Quarkus application.
pt_br: Este guia explica como começar a utilizar o gRPC na sua aplicação Quarkus.

source: This guide explains how to use Blaze-Persistence to simplify your data and DTO layers.
pt_br: Este guia explica como usar o Blaze-Persistence para simplificar suas camadas de dados e DTO.

source: This guide explains how to use Kotlin.
pt_br: Este guia explica como usar o Kotlin.

source: This guide explains how to use OpenID Connect and OAuth2 Client and Filters to acquire, refresh and propagate access tokens.
pt_br: Este guia explica como usar clientes e filtros OpenID Connect e o OAuth2 para adquirir, atualizar e propagar tokens de acesso.

source: This guide explains how to use Sentry to monitor your application and be notified when exceptions occur.
pt_br: Este guia explica como usar o Sentry para monitorar sua aplicação e ser notificado quando ocorrerem exceções.

source: This guide explains how to use Vert.x in Quarkus to build reactive applications.
pt_br: Este guia explica como usar o Vert.x no Quarkus para criar aplicativos reativos.

source: This guide explains how to use the OpenAPI extension to generate an OpenAPI descriptor and get a Swagger UI frontend to test your REST endpoints.
pt_br: Este guia explica como usar a extensão OpenAPI para gerar um descritor OpenAPI e obter um front-end da interface do usuário do Swagger para testar seus endpoints REST.

source: This guide explains how to use the RESTEasy REST Client in order to interact with REST APIs (JSON and other) with very little effort.
pt_br: Este guia explica como utilizar o RESTEasy REST Client para interagir com APIs REST (JSON e outras) com muito pouco esforço.

source: This guide explains how to use the RESTEasy REST Client to send multipart REST requests, typically to upload documents.
pt_br: Este guia explica como usar o RESTEasy REST Client para enviar solicitações REST multipart, normalmente para carregar documentos.

source: This guide explains how to use the RESTEasy Reactive REST Client.
pt_br: Este guia explica como utilizar o cliente RESTEasy Reactive REST.

source: This guide explains how you can access Git repositories with JGit.
pt_br: Este guia explica como você pode acessar repositórios Git com o JGit.

source: This guide explains how you can deploy Quarkus-based Amazon Lambdas.
pt_br: Este guia explica como você pode implantar o Amazon Lambdas baseado em Quarkus.

source: This guide explains how you can deploy Quarkus-based Google Cloud Functions.
pt_br: Este guia explica como você pode implantar o Google Cloud Functions baseado em Quarkus.

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as a Google Cloud Function.
pt_br: Este guia explica como você pode implantar microsserviços Vert.x Web, Servlet ou RESTEasy como uma função do Google Cloud.

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Amazon Lambda.
pt_br: Este guia explica como você pode implantar microsserviços Vert.x Web, Servlet ou RESTEasy como um Amazon Lambda.

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Azure Function.
pt_br: Este guia explica como você pode implantar microsserviços Vert.x Web, Servlet ou RESTEasy como uma Função do Azure.

source: This guide explains how you can use HashiCorp Vault for "encryption as a service".
pt_br: Este guia explica como você pode usar o HashiCorp Vault para "criptografia como serviço".

source: This guide explains how you can use HashiCorp Vault to securely store your credentials in Quarkus.
pt_br: Este guia explica como pode utilizar o HashiCorp Vault para armazenar de forma segura as suas credenciais no Quarkus.

source: This guide explains how your Quarkus application can read configuration properties at runtime from Consul.
pt_br: Este guia explica como seu aplicativo Quarkus pode ler propriedades de configuração em tempo de execução do Consul.

source: This guide explains how your Quarkus application can utilize OAuth2 tokens to provide secured access to the JAX-RS endpoints.
pt_br: Este guia explica como a sua aplicação Quarkus pode utilizar tokens OAuth2 para fornecer acesso seguro aos pontos de extremidade JAX-RS.

source: This guide explains how your Quarkus application can utilize OpenTelemetry to provide distributed tracing for interactive web applications.
pt_br: Este guia explica como sua aplicação Quarkus pode utilizar o OpenTelemetry para fornecer rastreamento distribuído para aplicativos Web interativos.

source: This guide explains how your Quarkus application can utilize OpenTracing to provide distributed tracing for interactive web applications.
pt_br: Este guia explica como sua aplicação Quarkus pode utilizar o OpenTracing para fornecer rastreamento distribuído para aplicativos Web interativos.

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications. Because it’s the canonical web socket application, we are going to create a simple chat application.
pt_br: Este guia explica como seu aplicativo Quarkus pode utilizar Websockets para criar aplicações web interativos. Como é um aplicativo websocket canônico, vamos criar um aplicativo de bate-papo simples.

source: This guide explains how your application can build, sign and/or encrypt JWT tokens with a fluent and configurable SmallRye JWT Build API.
pt_br: Este guia explica como sua aplicação pode construir, assinar e/ou criptografar tokens JWT com uma API SmallRye JWT Build fluente e configurável.

source: This guide explains how your application can utilize SmallRye JWT to verify JWT tokens and provide secured access to the JAX-RS endpoints.
pt_br: Este guia explica como seu aplicativo pode utilizar o SmallRye JWT para verificar tokens JWT e fornecer acesso seguro aos endpoints JAX-RS.

source: This guide explains logging and how to configure it.
pt_br: Este guia explica o registro em log e como configurá-lo.

source: This guide explains the various methods supported by Quarkus to authenticate to your Vault.
pt_br: Este guia explica os vários métodos suportados pelo Quarkus para autenticar no seu Vault.

source: This guide is a collection of tips to help you solve the problems you encounter when compiling applications to native executable.
pt_br: Este guia é uma coleção de dicas para ajudá-lo a resolver os problemas encontrados ao compilar aplicativos para executável nativo.

source: This guide is the entry point for everything security in Quarkus.
pt_br: Este guia é o ponto de entrada para tudo o que diz respeito à segurança em Quarkus.

source: This guide takes as input the application developed in the xref:getting-started.adoc[Getting Started Guide].
pt_br: Este guia utiliza como base a aplicação desenvolvida no link:getting-started.html[Guia de Iniciação].

source: This guide walks you through the process of creating a Quarkus application with OptaPlanner's constraint solving Artificial Intelligence (AI).
pt_br: Este guia orienta você pelo processo de criação de um aplicativo Quarkus com a Inteligência Artificial (IA) de resolução de restrições do OptaPlanner.

source: This guides covers the usage of LRA to coordinate activities across services.
pt_br: Este guia abrange o uso do LRA para coordenar atividades entre serviços.

source: This guides covers the usage of Software Transactional Memory (STM).
pt_br: Este guia aborda o uso da Memória Transacional de Software (STM).

source: This guides explains how to use the Vault credentials provider or implement your own custom one.
pt_br: Este guia explica como usar o provedor de credenciais do Vault ou implementar seu próprio provedor personalizado.

source: This handler is a bridge between the lambda runtime and the Quarkus HTTP framework you are using (Jakarta REST, Servlet, etc.)
pt_br: Este handler é uma ponte entre o tempo de execução do lambda e a estrutura HTTP do Quarkus que está a utilizando (Jakarta REST, Servlet, etc.)

source: This is helpful for both Java developers who are used to working with the imperative model and don’t want to switch things up, and those working with a cloud-native/reactive approach. The Quarkus development model can adapt itself to whatever app you’re developing.
pt_br: Isso é útil tanto para desenvolvedores Java que estão acostumados a trabalhar com o modelo imperativo e não querem mudar as coisas, quanto para aqueles que trabalham com uma abordagem nativa/reativa na nuvem. O modelo de desenvolvimento do Quarkus pode adaptar-se a qualquer aplicação que você esteja desenvolvendo.

source: This page explains how to enable xDS gRPC usage in your Quarkus application.
pt_br: Esta página explica como habilitar o uso do gRPC xDS em sua aplicação Quarkus.

source: This pattern has multiple advantages, such as:
pt_br: Este padrão tem várias vantagens, tais como:

source: This reference guide explains how to develop command line applications with Quarkus.
pt_br: Este guia de referência explica como desenvolver aplicações de linha de comandos com o Quarkus.

source: This reference guide explains in more details the configuration and usage of the Quarkus Mailer.
pt_br: Este guia de referência explica com mais detalhes a configuração e o uso do Quarkus Mailer.

source: This reference guide provides advanced details about the usage and the configuration of the Vert.x instance used by Quarkus.
pt_br: Este guia de referência fornece detalhes avançados sobre o uso e a configuração da instância Vert.x usada pelo Quarkus.

source: This reference guide provides an in-depth look on Apache Kafka and Smallrye Reactive Messaging framework.
pt_br: Este guia de referência fornece uma visão detalhada da estrutura Apache Kafka e Smallrye Reactive Messaging.

source: This technology is considered {extension-status}.
pt_br: Essa tecnologia é considerada {extension-status}.

source: This transitively adds `io.quarkus:quarkus-grpc` extension dependency.
pt_br: Isso adiciona de forma transitiva a dependência da extensão `io.quarkus:quarkus-grpc`.

source: This website is licensed under the [Creative Commons Attribution 3.0](https://creativecommons.org/licenses/by/3.0/).
pt_br: Este website é licenciado pela [Creative Commons Attribution 3.0](https://creativecommons.org/licenses/by/3.0/).

source: This will add the following to your build file:
pt_br: Isto irá adicionar o seguinte trecho no seu arquivo de build:

source: Thread safety: only one thread can access the object stored in the thread local - preventing concurrent accesses.
pt_br: Segurança da thread: apenas uma thread pode acessar o objeto armazenado na thread local - prevenindo acessos concorrentes.

source: Three development and execution models
pt_br: Três modelos de desenvolvimento e execução

source: TieredCompilation
pt_br: Compilação em camadas

source: Time to rock the Java world 2023 style…
pt_br: Hora de arrasar no estilo Java World 2023...

source: Timeout of unacked messages
pt_br: Tempo limite de mensagens não acked

source: To complete this guide, you need:
pt_br: Para concluir este guia, você precisa:

source: To containerize your Quarkus application that use `@RunOnVirtualThread`, add the following properties in your `application.properties`:
pt_br: Para conteinerizar a sua aplicação Quarkus que utiliza `@RunOnVirtualThread`, adicione as seguintes propriedades ao seu `application.properties`:
